Создать модель (ER -диаграмму)  базы данных.
Сгенерировать базу данных (скрипт) на основании модели.
Создать sql-скрипт для заполнения базы данных записями (минимум 3 записи на таблицу)
Написать sql-скрипт, использующий созданные представления, и проверить его работоспособность.
Сохранить файлы модели (ER-диаграммы) и sql-скрипты в проекте своего аккаунта GitHub
Во всех скриптах необходимы комментарии, на основании которых можно сделать документацию.



5-2-2: Кинотеатры.
Описание:
Кинотеатры: идентификтор, название, адрес, количество мест
Фильмы: идентификатор, название, год выпуска, киностудия, длительность, страна
афиша: идентификатор, фильм, дата начала проката, дата окончания проката, кинотеатр, количество сеансов в день, стоимость просмотра (1 зритель).
Зрители (билеты): идентификатор, номер афиши, день посещения, количество билетов.



Представления:
Самый кассовый фильм месяца
Кинотеатры по количеству свободных мест в день.
Фильм с указанием максимального количества зрителей в день.